<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Загрузим-и-ознакомимся-с-данными" data-toc-modified-id="Загрузим-и-ознакомимся-с-данными-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Загрузим и ознакомимся с данными</a></span><ul class="toc-item"><li><span><a href="#Подключимся-к-базе-и-загрузим-данные" data-toc-modified-id="Подключимся-к-базе-и-загрузим-данные-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Подключимся к базе и загрузим данные</a></span></li><li><span><a href="#Ознакомимся-с-данными" data-toc-modified-id="Ознакомимся-с-данными-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Ознакомимся с данными</a></span></li></ul></li><li><span><a href="#Посчитаем,-сколько-книг-вышло-после-1-января-2000-года" data-toc-modified-id="Посчитаем,-сколько-книг-вышло-после-1-января-2000-года-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Посчитаем, сколько книг вышло после 1 января 2000 года</a></span></li><li><span><a href="#Для-каждой-книги-посчитаем-количество-обзоров-и-среднюю-оценку" data-toc-modified-id="Для-каждой-книги-посчитаем-количество-обзоров-и-среднюю-оценку-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Для каждой книги посчитаем количество обзоров и среднюю оценку</a></span></li><li><span><a href="#Определим-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц" data-toc-modified-id="Определим-издательство,-которое-выпустило-наибольшее-число-книг-толще-50-страниц-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Определим издательство, которое выпустило наибольшее число книг толще 50 страниц</a></span></li><li><span><a href="#Определим-автора-с-самой-высокой-средней-оценкой-книг" data-toc-modified-id="Определим-автора-с-самой-высокой-средней-оценкой-книг-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Определим автора с самой высокой средней оценкой книг</a></span></li><li><span><a href="#Посчитаем-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок." data-toc-modified-id="Посчитаем-среднее-количество-обзоров-от-пользователей,-которые-поставили-больше-50-оценок.-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Посчитаем среднее количество обзоров от пользователей, которые поставили больше 50 оценок.</a></span></li></ul></div>

# SQL project

Коронавирус застал мир врасплох, изменив привычный порядок вещей. В свободное время жители городов больше не выходят на улицу, не посещают кафе и торговые центры. Зато стало больше времени для книг. Это заметили стартаперы — и бросились создавать приложения для тех, кто любит читать.

Наша компания решила быть на волне и купила крупный сервис для чтения книг по подписке. Наша первая задача — проанализировать базу данных.
В ней — информация о книгах, издательствах, авторах, а также пользовательские обзоры книг. Эти данные помогут сформулировать ценностное предложение для нового продукта.

***Описание данных***

**Таблица `books`**

Содержит данные о книгах:

- `book_id` — идентификатор книги;
- `author_id` — идентификатор автора;
- `title` — название книги;
- `num_pages` — количество страниц;
- `publication_date` — дата публикации книги;
- `publisher_id` — идентификатор издателя.

**Таблица `authors`**

Содержит данные об авторах:

- `author_id` — идентификатор автора;
- `author` — имя автора.

**Таблица `publishers`**

Содержит данные об издательствах:

- `publisher_id` — идентификатор издательства;
- `publisher` — название издательства;

**Таблица `ratings`**

Содержит данные о пользовательских оценках книг:

- `rating_id` — идентификатор оценки;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, оставившего оценку;
- `rating` — оценка книги.

**Таблица `reviews`**

Содержит данные о пользовательских обзорах на книги:

- `review_id` — идентификатор обзора;
- `book_id` — идентификатор книги;
- `username` — имя пользователя, написавшего обзор;
- `text` — текст обзора.

<img src = 'https://concrete-web-bad.notion.site/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F069818d1-0e5c-4d87-a461-0de584ab9c33%2FUntitled_(33).png?table=block&id=bd53c8db-b4fd-49eb-8cc9-572ebb3c9163&spaceId=9e4bd47b-c6e6-4ca3-bcee-279794b47315&width=1640&userId=&cache=v2'>

***Постановка задачи:***

- Небходимо посчитать, сколько книг вышло после 1 января 2000 года;
- Для каждой книги посчитать количество обзоров и среднюю оценку;
- Определитть издательство, которое выпустило наибольшее число книг толще 50 страниц — таким образом исключить из анализа брошюры;
- Определить автора с самой высокой средней оценкой книг — учитывая только книги с 50 и более оценками;
- Посчитайть среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

## Загрузим и ознакомимся с данными

In [1]:
# импортируем библиотеки
import pandas as pd
from sqlalchemy import create_engine

### Подключимся к базе и загрузим данные

In [2]:
#Подключимся к базе и загрузим данные
# устанавливаем параметры
db_config = {'user': 'praktikum_student', # имя пользователя
'pwd': 'Sdf4$2;d-d30pp', # пароль
'host': 'rc1b-wcoijxj3yxfsf3fs.mdb.yandexcloud.net',
'port': 6432, # порт подключения
'db': 'data-analyst-final-project-db'} # название базы данных
connection_string = 'postgresql://{}:{}@{}:{}/{}'.format(db_config['user'], db_config['pwd'], db_config['host'], db_config['port'],
db_config['db']) 
engine = create_engine(connection_string, connect_args={'sslmode':'require'})

### Ознакомимся с данными

In [3]:
for table in ['books', 'authors', 'publishers', 'ratings', 'reviews']:
    query = ''' SELECT* 
                FROM {}
            '''.format(table) 
    request = pd.io.sql.read_sql(query, con = engine) 
    display(request.head())

,book_id,author_id,title,num_pages,publication_date,publisher_id
0,1,546,'Salem's Lot,594,2005-11-01,93
1,2,465,1 000 Places to See Before You Die,992,2003-05-22,336
2,3,407,13 Little Blue Envelopes (Little Blue Envelope...,322,2010-12-21,135
3,4,82,1491: New Revelations of the Americas Before C...,541,2006-10-10,309
4,5,125,1776,386,2006-07-04,268

   author_id                          author
0          1                      A.S. Byatt
1          2  Aesop/Laura Harris/Laura Gibbs
2          3                 Agatha Christie
3          4                   Alan Brennert
4          5        Alan Moore/David   Lloyd

   publisher_id                          publisher
0             1                                Ace
1             2                           Ace Book
2             3                          Ace Books
3             4                      Ace Hardcover
4             5  Addison Wesley Publishing Company

   rating_id  book_id       username  rating
0          1        1     ryanfranco       4
1          2        1  grantpatricia       2
2          3        1   brandtandrea       5
3          4        2       lorichen       3
4          5        2    mariokeller       2

,review_id,book_id,username,text
0,1,1,brandtandrea,Mention society tell send professor analysis. ...
1,2,1,ryanfranco,Foot glass pretty audience hit themselves. Amo...
2,3,2,lorichen,Listen treat keep worry. Miss husband tax but ...
3,4,3,johnsonamanda,Finally month interesting blue could nature cu...
4,5,3,scotttamara,Nation purpose heavy give wait song will. List...

## Посчитаем, сколько книг вышло после 1 января 2000 года

In [4]:
query = ''' SELECT COUNT(book_id) 
            FROM books
            WHERE CAST(publication_date AS date) > '2000-01-01'
            '''.format(table) 
books_2000 = pd.io.sql.read_sql(query, con = engine)
books_2000

   count
0    819

## Для каждой книги посчитаем количество обзоров и среднюю оценку

In [6]:
query = ''' WITH
            rat AS
            (SELECT b.book_id AS book,
                   ROUND(AVG(rat.rating),2) AS average_rating
            FROM books AS b
            LEFT OUTER JOIN ratings AS rat ON b.book_id = rat.book_id
            GROUP BY b.book_id),
            rev AS 
            (SELECT b.book_id AS book,
                   b.author_id AS author,
                   b.title AS titleb,
                   COUNT(rev.review_id) reviews_number
            FROM books AS b
            LEFT OUTER JOIN reviews AS rev ON b.book_id = rev.book_id
            GROUP BY b.book_id, b.author_id, b.title
            ORDER BY reviews_number DESC)
            
            SELECT rev.book,
                   rev.author,
                   rev.titleb,
                   rat.average_rating,
                   rev.reviews_number
            FROM rev INNER JOIN rat ON rev.book = rat.book
            ORDER BY rat.average_rating DESC
            '''.format(table) 
reviews_and_rating = pd.io.sql.read_sql(query, con = engine)
reviews_and_rating

,book,author,titleb,average_rating,reviews_number
0,86,411,Arrows of the Queen (Heralds of Valdemar #1),5.00,2
1,901,506,The Walking Dead Book One (The Walking Dead #...,5.00,2
2,390,618,Light in August,5.00,2
3,972,313,Wherever You Go There You Are: Mindfulness Me...,5.00,2
4,136,299,Captivating: Unveiling the Mystery of a Woman'...,5.00,2
...,...,...,...,...,...
995,915,580,The World Is Flat: A Brief History of the Twen...,2.25,3
996,316,321,His Excellency: George Washington,2.00,2
997,202,91,Drowning Ruth,2.00,3
998,371,625,Junky,2.00,2
999,303,291,Harvesting the Heart,1.50,2

In [7]:
reviews_and_rating['reviews_number'].sum()

2793

## Определим издательство, которое выпустило наибольшее число книг толще 50 страниц
Так мы исключим из анализа брошюры

In [8]:
query = ''' SELECT p.publisher_id,
                   p.publisher,
                   COUNT(b.book_id) nuber_of_books
            FROM publishers AS p
            INNER JOIN books AS b ON p.publisher_id = b.publisher_id
            WHERE b.num_pages > 50
            GROUP BY p.publisher_id
            ORDER BY COUNT(b.book_id) DESC
            LIMIT 1
            '''.format(table) 
big_publisher = pd.io.sql.read_sql(query, con = engine)
big_publisher

   publisher_id      publisher  nuber_of_books
0           212  Penguin Books              42

## Определим автора с самой высокой средней оценкой книг
Учем только книги с 50 и более оценками

In [9]:
query = ''' SELECT a.author_id,
                   a.author,
                   ROUND(AVG(rat.rating), 2) average_rating
            FROM authors AS a
            INNER JOIN books AS b ON a.author_id = b.author_id
            INNER JOIN ratings AS rat ON b.book_id = rat.book_id
            WHERE rat.book_id IN (SELECT book_id
                               FROM ratings
                               GROUP BY book_id
                               HAVING COUNT(rating_id) > 50
                               )
            GROUP BY a.author_id
            ORDER BY average_rating DESC
            LIMIT 1
            '''.format(table) 
rating_author = pd.io.sql.read_sql(query, con = engine)
rating_author

   author_id                      author  average_rating
0        236  J.K. Rowling/Mary GrandPré            4.29

## Посчитаем среднее количество обзоров от пользователей, которые поставили больше 50 оценок.

In [10]:
query = ''' SELECT ROUND(AVG(active_users.count_reviews), 2) avg_number_of_reviews
            FROM (SELECT username,
                   COUNT(reviews) count_reviews
                  FROM reviews
                  WHERE username IN (SELECT username
                                     FROM ratings
                                     GROUP BY username
                                     HAVING COUNT(rating_id) > 50
                                     )
                  GROUP BY username
                  ) AS active_users
            '''.format(table) 
avg_number_of_reviews = pd.io.sql.read_sql(query, con = engine)
avg_number_of_reviews

   avg_number_of_reviews
0                  24.33